### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cdn.azurerm_monitor_scheduled_query_rules_alert.cdn_requests_error_alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "cdn_requests_error_alert" {
      + auto_mitigation_enabled = true
      + data_source_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + description             = "Elevated rate of 4xx and 5xx errors from the CDN"
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "[io-p-itn-wallet-cdnp-01] Request Errors"
      + query                   = <<-EOT
            AzureDiagnostics
            | where ResourceId == toupper("/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-wallet-cdnp-01")
            | where Category == "AzureCdnAccessLog"
            | where isReceivedFromClient_b == true
            | where requestUri_s == "https://wallet.io.pagopa.it:443/.well-known/openid-federation"
            | where httpStatus_d >= 400
            | summarize AggregatedValue = count()
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "io-p-itn-wallet-rg-01"
      + severity                = 0
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + time_window             = 5

      + action {
          + action_group = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01",
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror",
            ]
        }

      + trigger {
          + operator  = "GreaterThanOrEqual"
          + threshold = 1
        }
    }

  # module.storage_accounts.azurerm_monitor_metric_alert.poison_queue_creation_email will be created
  + resource "azurerm_monitor_metric_alert" "poison_queue_creation_email" {
      + auto_mitigate            = true
      + description              = "Poison queue for wallet creation emails exceeds threshold"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[wallet-instance-creation-email-queue-01] Poison Queue Alert"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01",
        ]
      + severity                 = 2
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "ApproximateMessagesCount"
          + metric_namespace       = "Microsoft.Storage/storageAccounts/queues"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 10

          + dimension {
              + name     = "QueueName"
              + operator = "Include"
              + values   = [
                  + "wallet-instance-creation-email-queue-01-poison",
                ]
            }
        }
    }

  # module.storage_accounts.azurerm_monitor_metric_alert.poison_queue_revocation_email will be created
  + resource "azurerm_monitor_metric_alert" "poison_queue_revocation_email" {
      + auto_mitigate            = true
      + description              = "Poison queue for wallet revocation emails exceeds threshold"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[wallet-instance-revocation-email-queue-01] Poison Queue Alert"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01",
        ]
      + severity                 = 2
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "ApproximateMessagesCount"
          + metric_namespace       = "Microsoft.Storage/storageAccounts/queues"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 10

          + dimension {
              + name     = "QueueName"
              + operator = "Include"
              + values   = [
                  + "wallet-instance-revocation-email-queue-01-poison",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>
